tests/Request/fixtures/updateCallbackUrl.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://eu.europa.ec.dgt.epoetry">
    <SOAP-ENV:Body>
        <ns1:updateCallbackUrl>
            <callbackUrl>http://example.com</callbackUrl>
            <applicationName>appname</applicationName>
        </ns1:updateCallbackUrl>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
