tests/Request/fixtures/addNewPartToDossierRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://eu.europa.ec.dgt.epoetry">
    <SOAP-ENV:Body>
        <ns1:addNewPartToDossier>
            <!--Optional:-->
            <dossier>
                <!--Optional:-->
                <requesterCode>DIGIT</requesterCode>
                <!--Optional:-->
                <number>17</number>
                <!--Optional:-->
                <year>2020</year>
            </dossier>
            <!--Optional:-->
            <requestDetails>
                <title>test JL</title>
                <!--Optional:-->
                <workflowCode></workflowCode>
                <!--Optional:-->
                <internalReference></internalReference>
                <!--Optional:-->
                <requestedDeadline>2021-06-04T10:59:00+02:00</requestedDeadline>
                <!--Optional:-->
                <sensitive>false</sensitive>
                <!--Optional:-->
                <sentViaRue>false</sentViaRue>
                <!--Optional:-->
                <documentToAdopt>false</documentToAdopt>
                <!--Optional:-->
                <decideReference></decideReference>
                <!--Optional:-->
                <destination>PUBLIC</destination>
                <procedure>DEGHP</procedure>
                <slaAnnex>ANNEX8B</slaAnnex>
                <slaCommitment>SI2.822223.1.B2020</slaCommitment>
                <comment>my request</comment>
                <accessibleTo>CONTACTS</accessibleTo>
                <keyword1>1111</keyword1>
                <keyword2>2222</keyword2>
                <keyword3>3333</keyword3>
                <contacts>
                    <contact userId="teodomi" contactRole="REQUESTER"/>
                    <contact userId="smithjo" contactRole="AUTHOR"/>
                    <contact userId="smithjo" contactRole="RECIPIENT"/>
                </contacts>
                <originalDocument>
                    <fileName>TEST_ORI.docx</fileName>
                    <comment></comment>
                    <content></content>
                    <linguisticSections>
                        <linguisticSection>
                            <language>DE</language>
                        </linguisticSection>
                    </linguisticSections>
                    <trackChanges></trackChanges>
                </originalDocument>
                <products>
                    <product>
                        <language>FI</language>
                    </product>
                    <product>
                        <language>RO</language>
                    </product>
                    <product>
                        <language>BG</language>
                    </product>
                    <product>
                        <language>FR</language>
                    </product>
                    <product>
                        <language>SE</language>
                    </product>
                </products>
                <auxiliaryDocuments>
                    <!--Optional:-->
                    <referenceDocuments>
                        <!--Zero or more repetitions:-->
                        <document>
                            <!--Optional:-->
                            <fileName>test.doc</fileName>
                            <language>FR</language>
                            <!--Optional:-->
                            <comment>test</comment>
                            <!--Optional:-->
                            <content>Y2lkOjMwMzYwNTgyNDExMg==</content>
                        </document>
                        <document>
                            <!--Optional:-->
                            <fileName>test_FI.doc</fileName>
                            <language>FI</language>
                            <!--Optional:-->
                            <comment>testFI</comment>
                            <!--Optional:-->
                            <content>Y2lkOjMwMzYwNTgyNDExMg==</content>
                        </document>
                    </referenceDocuments>
                    <!--Optional:-->
                    <srcDocument>
                        <!--Optional:-->
                        <fileName>testSRC.docx</fileName>
                        <!--Optional:-->
                        <comment>77777</comment>
                        <!--Optional:-->
                        <content>Y2lkOjE1MzE4ODQ3MDQyMjY=</content>
                    </srcDocument>
                </auxiliaryDocuments>
            </requestDetails>
            <!--Optional:-->
            <applicationName>application1</applicationName>
        </ns1:addNewPartToDossier>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
